Repository: Lcasmendes/Trabalho-2-Dev_Mobile
Catalog: book_trades/lib/l10n/app_*.arb
Languages: pt

source: Login Page
pt: Book Trade

source: Password
pt: Senha

source: Login
pt: Logar

source: Empty
pt: Vazio

source: Main Page
pt: Página Principal

source: Some text here!
pt: Algum texto aqui!

source: Loading...
pt: Carregando...

# view_log_of_login_tries
source: View the log of login tries
pt: Ver o registro de tentativas de login

source: Login Tries Page
pt: Página de tentativas de Login

source: Login tries so far:
pt: Tentativas até o momento:

# navBarHome
source: Exchanges
pt: Trocas

# navBarMyExchanges
source: My Exchanges
pt: Minhas Trocas

# navBarNewExchange
source: New Exchange
pt: Nova Troca

# mainPageTitle
source: Exchanges
pt: Trocas

# myExchangesPageTitle
source: My Exchanges
pt: Minhas Trocas

# mainPageWelcomeMessage
source: Welcome to the Main Page!
pt: Bem-vindo à Página Principal!

source: No exchanges available.
pt: Nenhuma troca disponível.

# errorLoadingExchanges
source: Error loading exchanges: {errorMessage}
pt: Erro ao carregar trocas: {errorMessage}

# exchangeState
source: State
pt: Estado

# exchangeSearchingFor
source: Searching for
pt: Buscando por

# exchangeSuggestions
source: Suggestions
pt: Sugestões

# exchangeOffers
source: Offers
pt: Ofertas

# searchBarHint
source: Search
pt: Pesquisar

source: No exchanges found for "{query}".
pt: Nenhuma troca encontrada para "{query}".

# newExchangePageTitle
source: Register Exchange
pt: Cadastrar troca

# bookNameHint
source: Book Name (required)
pt: Nome do livro (obrigatório)

# bookStateTitle
source: Book State (required)
pt: Estado do livro (obrigatório)

# stateNew
source: New
pt: Novo

# stateSemiNew
source: Semi-new
pt: Seminovo

# statePreserved
source: Preserved
pt: Conservado

# stateDamaged
source: Damaged
pt: Danificado

# genresTitle
source: Desired Genres
pt: Gêneros buscados

# onlySuggestions
source: Only exchange suggestions
pt: Apenas as sugestões de troca

# genreFantasy
source: Fantasy
pt: Fantasia

# genreSciFi
source: Science Fiction
pt: Ficção científica

# genreMystery
source: Mystery
pt: Mistério

# genreHorror
source: Horror
pt: Terror

# genreNonFiction
source: Non-fiction
pt: Não ficção

# suggestionsHint
source: Exchange Suggestions
pt: Sugestões de troca

# registerButton
source: Register
pt: Cadastrar

# exchangeRegisteredSuccess
source: Exchange registered successfully!
pt: Troca cadastrada com sucesso!

# validationRequiredField
source: This field is required.
pt: Este campo é obrigatório.

# validationSelectState
source: Please select a book state.
pt: Por favor, selecione um estado para o livro.

# genresOrSuggestionsRequired
source: Please select at least one genre or fill in the suggestions.
pt: Por favor, selecione pelo menos um gênero ou preencha as sugestões.

# exchangeRegisteredError
source: Error registering the exchange
pt: Erro ao registrar troca.

source: Unknown error
pt: Ocorreu um erro desconhecido.

# exchangeDetailsTitle
source: Exchange Details
pt: Detalhes da Troca

# makeOfferTitle
source: Make an Offer
pt: Fazer uma oferta

# offeringBookNameHint
source: Book you are offering
pt: Nome do livro que você oferece

# offeringBookStateTitle
source: State of your book
pt: Estado do seu livro

# makeOfferButton
source: Make Offer
pt: Fazer oferta

source: Offer made successfully!
pt: Oferta realizada com sucesso!

source: Failed to make offer.
pt: Falha ao fazer oferta.

# userNotLoggedInError
source: You must be logged in to make an offer.
pt: Você precisa estar logado para fazer uma oferta.

# currentOffersTitle
source: Current Offers for this Exchange
pt: Ofertas atuais para esta troca

source: Offered Book
pt: Livro Ofertado

# offeredBookState
source: State
pt: Estado
